iot-chalmers/BlueFlood/cpu/cc26xx-cc13xx/lib/cc13xxware/inc/hw_flash.h
/******************************************************************************
*  Filename:       hw_flash_h
*  Revised:        2015-06-29 09:10:28 +0200 (Mon, 29 Jun 2015)
*  Revision:       44054
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_FLASH_H__
#define __HW_FLASH_H__

//*****************************************************************************
//
// This section defines the register offsets of
// FLASH component
//
//*****************************************************************************
// FMC and Efuse Status
#define FLASH_O_STAT                                                0x0000001C

// Configuration
#define FLASH_O_CFG                                                 0x00000024

// Syscode Start Address Offset Configuration
#define FLASH_O_SYSCODE_START                                       0x00000028

// Flash Size Configuration
#define FLASH_O_FLASH_SIZE                                          0x0000002C

// Firmware Lock
#define FLASH_O_FWLOCK                                              0x0000003C

// Firmware Flags
#define FLASH_O_FWFLAG                                              0x00000040

// E-Fuse instruction register
#define FLASH_O_EFUSE                                               0x00001000

// E-Fuse address register
#define FLASH_O_EFUSEADDR                                           0x00001004

// E-Fuse data register - upper
#define FLASH_O_DATAUPPER                                           0x00001008

// E-fuse data register - lower
#define FLASH_O_DATALOWER                                           0x0000100C

// OCP standard system configuration register
#define FLASH_O_EFUSECFG                                            0x00001010

// System Status
#define FLASH_O_EFUSESTAT                                           0x00001014

// Arbitrary Instruction count
#define FLASH_O_ACC                                                 0x00001018

// Boundary test register to drive I/O
#define FLASH_O_BOUNDARY                                            0x0000101C

// Efuse Key Loaded Flag
#define FLASH_O_EFUSEFLAG                                           0x00001020

// Efuse Key
#define FLASH_O_EFUSEKEY                                            0x00001024

// Efuse Release
#define FLASH_O_EFUSERELEASE                                        0x00001028

// Efuse Pins
#define FLASH_O_EFUSEPINS                                           0x0000102C

// Efuse Column Repair Address
#define FLASH_O_EFUSECRA                                            0x00001030

// Efuse Read
#define FLASH_O_EFUSEREAD                                           0x00001034

// Efuse Program
#define FLASH_O_EFUSEPROGRAM                                        0x00001038

// Efuse Error
#define FLASH_O_EFUSEERROR                                          0x0000103C

// Single-Bit Error Status
#define FLASH_O_SINGLEBIT                                           0x00001040

// Two-Bit Error Status
#define FLASH_O_TWOBIT                                              0x00001044

// Self-Test Cycles
#define FLASH_O_SELFTESTCYC                                         0x00001048

// Self-Test Signature
#define FLASH_O_SELFTESTSIGN                                        0x0000104C

// FMC Read Control
#define FLASH_O_FRDCTL                                              0x00002000

// FMC Read Margin Control
#define FLASH_O_FSPRD                                               0x00002004

// FMC Error Correction Control 1
#define FLASH_O_FEDACCTL1                                           0x00002008

// FMC Error Status
#define FLASH_O_FEDACSTAT                                           0x0000201C

// FMC Bank Protection
#define FLASH_O_FBPROT                                              0x00002030

// FMC Bank Sector Enable
#define FLASH_O_FBSE                                                0x00002034

// FMC Bank Busy
#define FLASH_O_FBBUSY                                              0x00002038

// FMC Bank Access Control
#define FLASH_O_FBAC                                                0x0000203C

// FMC Bank Fallback Power
#define FLASH_O_FBFALLBACK                                          0x00002040

// FMC Bank/Pump Ready
#define FLASH_O_FBPRDY                                              0x00002044

// FMC Pump Access Control 1
#define FLASH_O_FPAC1                                               0x00002048

// FMC Pump Access Control 2
#define FLASH_O_FPAC2                                               0x0000204C

// FMC Module Access Control
#define FLASH_O_FMAC                                                0x00002050

// FMC Module Status
#define FLASH_O_FMSTAT                                              0x00002054

// FMC Flash Lock
#define FLASH_O_FLOCK                                               0x00002064

