iot-chalmers/BlueFlood/cpu/cc26xx-cc13xx/lib/cc13xxware/inc/hw_flash.h
// Field:     [1] DIS_STANDBY
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_DIS_STANDBY                                       0x00000002
#define FLASH_CFG_DIS_STANDBY_BITN                                           1
#define FLASH_CFG_DIS_STANDBY_M                                     0x00000002
#define FLASH_CFG_DIS_STANDBY_S                                              1

// Field:     [0] DIS_IDLE
//
// Internal. Only to be used through TI provided API.
#define FLASH_CFG_DIS_IDLE                                          0x00000001
#define FLASH_CFG_DIS_IDLE_BITN                                              0
#define FLASH_CFG_DIS_IDLE_M                                        0x00000001
#define FLASH_CFG_DIS_IDLE_S                                                 0

//*****************************************************************************
//
// Register: FLASH_O_SYSCODE_START
//
//*****************************************************************************
// Field:   [4:0] SYSCODE_START
//
// Internal. Only to be used through TI provided API.
#define FLASH_SYSCODE_START_SYSCODE_START_M                         0x0000001F
#define FLASH_SYSCODE_START_SYSCODE_START_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FLASH_SIZE
//
//*****************************************************************************
// Field:   [7:0] SECTORS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FLASH_SIZE_SECTORS_M                                  0x000000FF
#define FLASH_FLASH_SIZE_SECTORS_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FWLOCK
//
//*****************************************************************************
// Field:   [2:0] FWLOCK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWLOCK_FWLOCK_M                                       0x00000007
#define FLASH_FWLOCK_FWLOCK_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_FWFLAG
//
//*****************************************************************************
// Field:   [2:0] FWFLAG
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWFLAG_FWFLAG_M                                       0x00000007
#define FLASH_FWFLAG_FWFLAG_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_EFUSE
//
//*****************************************************************************
// Field: [28:24] INSTRUCTION
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSE_INSTRUCTION_M                                   0x1F000000
#define FLASH_EFUSE_INSTRUCTION_S                                           24

// Field:  [15:0] DUMPWORD
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSE_DUMPWORD_M                                      0x0000FFFF
#define FLASH_EFUSE_DUMPWORD_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_EFUSEADDR
//
//*****************************************************************************
// Field: [15:11] BLOCK
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEADDR_BLOCK_M                                     0x0000F800
#define FLASH_EFUSEADDR_BLOCK_S                                             11

// Field:  [10:0] ROW
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSEADDR_ROW_M                                       0x000007FF
#define FLASH_EFUSEADDR_ROW_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_DATAUPPER
//
//*****************************************************************************
// Field:   [7:3] SPARE
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATAUPPER_SPARE_M                                     0x000000F8
#define FLASH_DATAUPPER_SPARE_S                                              3

// Field:     [2] P
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATAUPPER_P                                           0x00000004
#define FLASH_DATAUPPER_P_BITN                                               2
#define FLASH_DATAUPPER_P_M                                         0x00000004
#define FLASH_DATAUPPER_P_S                                                  2

// Field:     [1] R
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATAUPPER_R                                           0x00000002
#define FLASH_DATAUPPER_R_BITN                                               1
#define FLASH_DATAUPPER_R_M                                         0x00000002
#define FLASH_DATAUPPER_R_S                                                  1

// Field:     [0] EEN
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATAUPPER_EEN                                         0x00000001
#define FLASH_DATAUPPER_EEN_BITN                                             0
#define FLASH_DATAUPPER_EEN_M                                       0x00000001
#define FLASH_DATAUPPER_EEN_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_DATALOWER
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// Internal. Only to be used through TI provided API.
#define FLASH_DATALOWER_DATA_M                                      0xFFFFFFFF
#define FLASH_DATALOWER_DATA_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_EFUSECFG
//
//*****************************************************************************
// Field:     [8] IDLEGATING
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSECFG_IDLEGATING                                   0x00000100
#define FLASH_EFUSECFG_IDLEGATING_BITN                                       8
#define FLASH_EFUSECFG_IDLEGATING_M                                 0x00000100
#define FLASH_EFUSECFG_IDLEGATING_S                                          8

// Field:   [4:3] SLAVEPOWER
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSECFG_SLAVEPOWER_M                                 0x00000018
#define FLASH_EFUSECFG_SLAVEPOWER_S                                          3

// Field:     [0] GATING
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSECFG_GATING                                       0x00000001
#define FLASH_EFUSECFG_GATING_BITN                                           0
#define FLASH_EFUSECFG_GATING_M                                     0x00000001
#define FLASH_EFUSECFG_GATING_S                                              0

//*****************************************************************************
//
// Register: FLASH_O_EFUSESTAT
//
//*****************************************************************************
// Field:     [0] RESETDONE
//
// Internal. Only to be used through TI provided API.
#define FLASH_EFUSESTAT_RESETDONE                                   0x00000001
#define FLASH_EFUSESTAT_RESETDONE_BITN                                       0
#define FLASH_EFUSESTAT_RESETDONE_M                                 0x00000001
#define FLASH_EFUSESTAT_RESETDONE_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_ACC
//
//*****************************************************************************
// Field:  [23:0] ACCUMULATOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_ACC_ACCUMULATOR_M                                     0x00FFFFFF
#define FLASH_ACC_ACCUMULATOR_S                                              0

//*****************************************************************************
//
// Register: FLASH_O_BOUNDARY
//
//*****************************************************************************
// Field:    [23] DISROW0
//
// Internal. Only to be used through TI provided API.
#define FLASH_BOUNDARY_DISROW0                                      0x00800000
#define FLASH_BOUNDARY_DISROW0_BITN                                         23
#define FLASH_BOUNDARY_DISROW0_M                                    0x00800000
#define FLASH_BOUNDARY_DISROW0_S                                            23

// Field:    [22] SPARE
//
// Internal. Only to be used through TI provided API.
#define FLASH_BOUNDARY_SPARE                                        0x00400000
#define FLASH_BOUNDARY_SPARE_BITN                                           22
#define FLASH_BOUNDARY_SPARE_M                                      0x00400000
#define FLASH_BOUNDARY_SPARE_S                                              22

