iot-chalmers/BlueFlood/cpu/cc26xx-cc13xx/lib/cc13xxware/inc/hw_flash.h
// Field:   [7:6] BANKPWR3
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_BANKPWR3_M                                 0x000000C0
#define FLASH_FBFALLBACK_BANKPWR3_S                                          6

// Field:   [5:4] BANKPWR2
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_BANKPWR2_M                                 0x00000030
#define FLASH_FBFALLBACK_BANKPWR2_S                                          4

// Field:   [3:2] BANKPWR1
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_BANKPWR1_M                                 0x0000000C
#define FLASH_FBFALLBACK_BANKPWR1_S                                          2

// Field:   [1:0] BANKPWR0
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBFALLBACK_BANKPWR0_M                                 0x00000003
#define FLASH_FBFALLBACK_BANKPWR0_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FBPRDY
//
//*****************************************************************************
// Field:    [16] BANKBUSY
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBPRDY_BANKBUSY                                       0x00010000
#define FLASH_FBPRDY_BANKBUSY_BITN                                          16
#define FLASH_FBPRDY_BANKBUSY_M                                     0x00010000
#define FLASH_FBPRDY_BANKBUSY_S                                             16

// Field:    [15] PUMPRDY
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBPRDY_PUMPRDY                                        0x00008000
#define FLASH_FBPRDY_PUMPRDY_BITN                                           15
#define FLASH_FBPRDY_PUMPRDY_M                                      0x00008000
#define FLASH_FBPRDY_PUMPRDY_S                                              15

// Field:     [0] BANKRDY
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBPRDY_BANKRDY                                        0x00000001
#define FLASH_FBPRDY_BANKRDY_BITN                                            0
#define FLASH_FBPRDY_BANKRDY_M                                      0x00000001
#define FLASH_FBPRDY_BANKRDY_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_FPAC1
//
//*****************************************************************************
// Field: [27:16] PSLEEPTDIS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FPAC1_PSLEEPTDIS_M                                    0x0FFF0000
#define FLASH_FPAC1_PSLEEPTDIS_S                                            16

// Field:  [15:4] PUMPRESET_PW
//
// Internal. Only to be used through TI provided API.
#define FLASH_FPAC1_PUMPRESET_PW_M                                  0x0000FFF0
#define FLASH_FPAC1_PUMPRESET_PW_S                                           4

// Field:   [1:0] PUMPPWR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FPAC1_PUMPPWR_M                                       0x00000003
#define FLASH_FPAC1_PUMPPWR_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_FPAC2
//
//*****************************************************************************
// Field:  [15:0] PAGP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FPAC2_PAGP_M                                          0x0000FFFF
#define FLASH_FPAC2_PAGP_S                                                   0

//*****************************************************************************
//
// Register: FLASH_O_FMAC
//
//*****************************************************************************
// Field:   [2:0] BANK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMAC_BANK_M                                           0x00000007
#define FLASH_FMAC_BANK_S                                                    0

//*****************************************************************************
//
// Register: FLASH_O_FMSTAT
//
//*****************************************************************************
// Field:    [17] RVSUSP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_RVSUSP                                         0x00020000
#define FLASH_FMSTAT_RVSUSP_BITN                                            17
#define FLASH_FMSTAT_RVSUSP_M                                       0x00020000
#define FLASH_FMSTAT_RVSUSP_S                                               17

// Field:    [16] RDVER
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_RDVER                                          0x00010000
#define FLASH_FMSTAT_RDVER_BITN                                             16
#define FLASH_FMSTAT_RDVER_M                                        0x00010000
#define FLASH_FMSTAT_RDVER_S                                                16

// Field:    [15] RVF
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_RVF                                            0x00008000
#define FLASH_FMSTAT_RVF_BITN                                               15
#define FLASH_FMSTAT_RVF_M                                          0x00008000
#define FLASH_FMSTAT_RVF_S                                                  15

// Field:    [14] ILA
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_ILA                                            0x00004000
#define FLASH_FMSTAT_ILA_BITN                                               14
#define FLASH_FMSTAT_ILA_M                                          0x00004000
#define FLASH_FMSTAT_ILA_S                                                  14

// Field:    [13] DBF
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_DBF                                            0x00002000
#define FLASH_FMSTAT_DBF_BITN                                               13
#define FLASH_FMSTAT_DBF_M                                          0x00002000
#define FLASH_FMSTAT_DBF_S                                                  13

// Field:    [12] PGV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_PGV                                            0x00001000
#define FLASH_FMSTAT_PGV_BITN                                               12
#define FLASH_FMSTAT_PGV_M                                          0x00001000
#define FLASH_FMSTAT_PGV_S                                                  12

// Field:    [11] PCV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_PCV                                            0x00000800
#define FLASH_FMSTAT_PCV_BITN                                               11
#define FLASH_FMSTAT_PCV_M                                          0x00000800
#define FLASH_FMSTAT_PCV_S                                                  11

// Field:    [10] EV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMSTAT_EV                                             0x00000400
#define FLASH_FMSTAT_EV_BITN                                                10
#define FLASH_FMSTAT_EV_M                                           0x00000400
#define FLASH_FMSTAT_EV_S                                                   10

